<!-- Using Mercurial Queues with Codereview -->

<h2 id="Introduction">Introducci&oacute;n</h2>

<p>
La extensi&oacute;n Queues de Mercurial (<code>mq</code>) provee un mecanismo para
manejar parches sobre un repositorio Mercurial y est&aacute; descrito en detalle en los
cap&iacute;tulos
<a href="http://hgbook.red-bean.com/read/managing-change-with-mercurial-queues.html">12</a>
y <a href="http://hgbook.red-bean.com/read/advanced-uses-of-mercurial-queues.html">13</a>
de <a href="http://hgbook.red-bean.com/read/">Mercurial: The Definitive Guide</a>.
Este documento explica c&oacute;mo usar <code>mq</code> en conjunci&oacute;n con la extensi&oacute;n
de Mercurial <code>codereview</code> descrita en las instrucciones para <a
	href="contribute.html">contribuir al proyecto Go</a>.
Este tutorial asume que se han le&iacute;do dichas instrucciones.
</p>

<h2>Configuraci&oacute;n</h2>

<p>
Para habilitar <code>mq</code> edita bien <code>$HOME/.hgrc</code> (para
habilitarlo para todos tus repositorios) o bien <code>$GOROOT/.hg/hgrc</code>
(para habilitarlo para el repositorio alojado en <code>$GOROOT</code>) para
a&ntilde;adir:</p>

<pre>
[extensions]
mq=
</pre>

<p>
Dado que hacer un pull, push y actualizar y realizar un commit mientras se
aplican parches <code>mq</code> puede da&ntilde;ar tu repositorio o uno remoto, a&ntilde;ade estas l&iacute;neas para
prevenir este caso:
</p>

<pre>
[hooks]
# Prevenir "hg pull" si se aplican parches MQ.
prechangegroup.mq-no-pull = ! hg qtop > /dev/null 2>&amp;1
# Prevenir "hg push" si se aplican parches MQ.
preoutgoing.mq-no-push = ! hg qtop > /dev/null 2>&amp;1
# Prevenir "hg update" si se aplican parches MQ.
preupdate.mq-no-update = ! hg qtop > /dev/null 2>&amp;1
</pre>

<h2>Realizando un cambio</h2>

<p>
El &aacute;rbol de directorios obtenido al realizar un checkout del repositorio es
editable y se puede usar <code>mq</code>, tal y como se documenta en el cap&iacute;tulo
<a href="http://hgbook.red-bean.com/read/managing-change-with-mercurial-queues.html">12</a>
de "The Guide", para implementar tus cambios como uno o una serie de parches.
</p>

<p>Cuando termines y est&eacute;s listo para enviar un cambio para que sea revisado,
ejecuta</p>

<pre>
$ hg change
</pre>

<p>desde cualquier directorio en tu repositorio de Go con todos los parches
<code>mq</code> relevantes para tu cambio aplicados y procede, despu&eacute;s, tal
y como se muestra en <a href="contribute.html">contribuyendo con el proyecto Go</a>.
</p>

<p>
El n&uacute;mero de cambio obtenido por <code>hg change</code>, precedido por un <code>+</code>,
puede ser utilizado como una guarda de un parche <code>mq</code> para controlar
qu&eacute; parches est&aacute;n siendo aplicados tal y como se describe en el cap&iacute;tulo
<a href="http://hgbook.red-bean.com/read/advanced-uses-of-mercurial-queues.html">13</a>
de "The Guide".
Por ejemplo, el comando:
</p>

<pre>
for p in $(hg qapplied); do hg qguard $p +99999; done
</pre>

<p>
aplicar&aacute; la guarda <code>+99999</code> a todos los parches <code>mq</code>
actualmente aplicados.
</p>

<h2>Sincronizando tu cliente</h2>

<p>Mientras est&aacute;s trabajando, otros pueden haber enviado cambios al repositorio
y, tal y como se explica en <a href="contribute.html">contribuyendo al proyecto
	Go</a>, es necesario sincronizar tu repositorio utilizando <code>hg
	sync</code> antes de enviar tu cambio a la lista para que sea revisado.
Ya que <code>hg sync</code> ejecuta <code>hg pull -u</code>, no deber&iacute;as
ejecutar <code>hg sync</code> mientras se aplican parches <code>mq</code>. En su
lugar, quita todos los parches antes de ejecutar <code>hg sync</code>
y apl&iacute;calos nuevamente despu&eacute;s de haber terminado de sincronizar.
</p>

<p>
Cuando vuelvas a aplicar los parches, quiz&aacute; necesites resolver los conflictos
generados tal y como se describe en <a href="contribute.html">contribuyendo al
	proyecto Go</a>.
</p>

<h2>Enviando el cambio para su revisi&oacute;n</h2>

<p>
Deber&iacute;as tener todos los parches <code>mq</code> relevantes para el cambio
aplicados cuando ejecutes <code>hg mail</code>.

<h2>Enviando el cambio despu&eacute;s de su revisi&oacute;n</h2>

Si eres un committer, deber&aacute;s tener aplicados todos los parches <code>mq</code>
relevantes para el cambio cuando ejecutes <code>hg commit</code>.
